{
  "_name_or_path": "dbmdz/bert-base-italian-cased",
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ING",
    "1": "I-ING",
    "2": "B-QUANTITY",
    "3": "I-QUANTITY",
    "4": "B-UNIT",
    "5": "I-UNIT",
    "6": "B-STATE",
    "7": "I-STATE",
    "8": "B-PART",
    "9": "I-PART",
    "10": "B-EQUIPMENT",
    "11": "I-EQUIPMENT",
    "12": "B-ALT",
    "13": "I-ALT",
    "14": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ALT": 12,
    "B-EQUIPMENT": 10,
    "B-ING": 0,
    "B-PART": 8,
    "B-QUANTITY": 2,
    "B-STATE": 6,
    "B-UNIT": 4,
    "I-ALT": 13,
    "I-EQUIPMENT": 11,
    "I-ING": 1,
    "I-PART": 9,
    "I-QUANTITY": 3,
    "I-STATE": 7,
    "I-UNIT": 5,
    "O": 14
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.26.1",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 31102
}
